app/controllers/chords_controller.rb

  def index
    # @chords = Chord.all
    @q = Chord.ransack(params[:q])
    @chords = @q.result(distinct: true).page(params[:page])
---
SELECT DISTINCT "chords".* FROM "chords" WHERE "chords"."chords" LIKE '%a%'

    def set_chord
      @chord = Chord.find(params[:id])
---
SELECT "chords".* FROM "chords" WHERE "chords"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]